control_inventario/app/controllers/clientes_controller.rb

  def index
    @clientes = Cliente.all
---
SELECT * FROM "clientes"

  def show
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 0)

  def edit
    @cliente = Cliente.find(params[:id])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 5)

  def create
    @cliente = Cliente.new(params[:cliente])

    respond_to do |format|
      if @cliente.save
---
INSERT INTO "clientes" ("Telefono", "Fax", "Nombre", "Email", "Direccion", "Pais", "Nit", "updated_at", "created_at") VALUES(NULL, NULL, 'juan', '', '', '', '15464124', '2012-09-20 18:50:22', '2012-09-20 18:50:22')

  def update
    @cliente = Cliente.find(params[:id])

    respond_to do |format|
      if @cliente.update_attributes(params[:cliente])
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 5)
UPDATE "clientes" SET "Nit" = '252', "updated_at" = '2012-09-19 18:20:21' WHERE "id" = 5

  def destroy
    @cliente = Cliente.find(params[:id])
    @cliente.destroy
---
SELECT * FROM "clientes" WHERE ("clientes"."id" = 1)
DELETE FROM "clientes" WHERE "id" = 1