control_inventario/app/controllers/proveedores_controller.rb

SELECT * FROM "proveedores"
---
  def index
    @proveedores = Proveedore.all

SELECT * FROM "proveedores" WHERE ("proveedores"."id" = 0)
---
  def show
    @proveedore = Proveedore.find(params[:id])

SELECT * FROM "proveedores" WHERE ("proveedores"."id" = 3)
---
  def edit
    @proveedore = Proveedore.find(params[:id])

INSERT INTO "proveedores" ("Telefono", "Fax", "Nombre", "Email", "Direccion", "Pais", "Nit", "updated_at", "created_at") VALUES(NULL, NULL, 'francisco', '', '', '', '2536152', '2012-09-20 18:50:08', '2012-09-20 18:50:08')
---
  def create
    @proveedore = Proveedore.new(params[:proveedore])

    respond_to do |format|
      if @proveedore.save

SELECT * FROM "proveedores" WHERE ("proveedores"."id" = 4)
---
  def update
    @proveedore = Proveedore.find(params[:id])

SELECT * FROM "proveedores" WHERE ("proveedores"."id" = 1)
DELETE FROM "proveedores" WHERE "id" = 1
---
  def destroy
    @proveedore = Proveedore.find(params[:id])
    @proveedore.destroy